## Data transformation

In [28]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn-white')

In [29]:
df = pd.read_csv('customer_supermarket_prepared.csv', sep=',')
df.drop(columns=['Unnamed: 0'], inplace=True)
df

,BasketID,BasketDate,Sale,CustomerID,CustomerCountry,ProdID,ProdDescr,Qta,TotSale
0,536365,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,15.30
1,536365,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,71053,WHITE METAL LANTERN,6,20.34
2,536365,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,84406B,CREAM CUPID HEARTS COAT HANGER,8,22.00
3,536365,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,20.34
4,536365,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,20.34
...,...,...,...,...,...,...,...,...,...
390916,581587,2011-12-09 12:50:00,0.85,12680.0,France,22613,PACK OF 20 SPACEBOY NAPKINS,12,10.20
390917,581587,2011-12-09 12:50:00,2.10,12680.0,France,22899,CHILDREN'S APRON DOLLY GIRL,6,12.60
390918,581587,2011-12-09 12:50:00,4.15,12680.0,France,23254,CHILDRENS CUTLERY DOLLY GIRL,4,16.60
390919,581587,2011-12-09 12:50:00,4.15,12680.0,France,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,16.60
390920,581587,2011-12-09 12:50:00,4.95,12680.0,France,22138,BAKING SET 9 PIECE RETROSPOT,3,14.85

In [31]:
df1 = df.groupby('CustomerID').aggregate({'Qta':'sum', 'ProdID':'nunique'})
df1.rename(columns={'Qta':'I', 'ProdID':'Iu'}, inplace=True)
df1

                I   Iu
CustomerID
12346.0     74215    1
12347.0      2458  103
12348.0      2332   21
12349.0       630   72
12350.0       196   16
...           ...  ...
18280.0        45   10
18281.0        54    7
18282.0       103   12
18283.0      1355  262
18287.0      1586   59

[4331 rows x 2 columns]

In [32]:
df_agg = df.groupby(['CustomerID', 'BasketID']).aggregate({'Qta':'sum'})
df_agg

                       Qta
CustomerID BasketID
12346.0    541431    74215
12347.0    537626      319
           542237      315
           549222      483
           556201      196
...                    ...
18283.0    579673      132
           580872      142
18287.0    554065      488
           570715      990
           573167      108

[18405 rows x 1 columns]

In [33]:
df_agg.reset_index(level='CustomerID')

          CustomerID    Qta
BasketID
541431       12346.0  74215
537626       12347.0    319
542237       12347.0    315
549222       12347.0    483
556201       12347.0    196
...              ...    ...
579673       18283.0    132
580872       18283.0    142
554065       18287.0    488
570715       18287.0    990
573167       18287.0    108

[18405 rows x 2 columns]

In [36]:
df2 = df_agg.reset_index(level='CustomerID').groupby('CustomerID').aggregate({'Qta':'max'})
df2.rename(columns={'Qta':'Imax'}, inplace=True)
df2

             Imax
CustomerID
12346.0     74215
12347.0       676
12348.0      1248
12349.0       630
12350.0       196
...           ...
18280.0        45
18281.0        54
18282.0        75
18283.0       241
18287.0       990

[4331 rows x 1 columns]

In [40]:
df_customer = pd.merge(df1, df2, on='CustomerID')
df_customer

                I   Iu   Imax
CustomerID
12346.0     74215    1  74215
12347.0      2458  103    676
12348.0      2332   21   1248
12349.0       630   72    630
12350.0       196   16    196
...           ...  ...    ...
18280.0        45   10     45
18281.0        54    7     54
18282.0       103   12     75
18283.0      1355  262    241
18287.0      1586   59    990

[4331 rows x 3 columns]